//Задайте строку, содержащую латинские буквы в обоих регистрах. Сформируйте строку, в которой все заглавные буквы заменены на строчные.


Console.WriteLine("Введите строку на латинице");
string text = Console.ReadLine().ToLower();
Console.WriteLine(text);